1s/ERP/Conf/Documents/Лико_УстановкаСрокаГодностиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_УстановкаСрокаГодностиМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ИсторияВидаНастроечногоМатериала</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_Срочность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоНаработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусЗаявокНаСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРемонтРЦ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутренняяПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаРаскрой</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаказНаРаскрой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаработкаТекущейОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеПоНаработке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНастроечногоМатериала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпотребитьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпотребитьДоНовый</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводстваНовый</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_СрокиГодностиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_СрокиГодностиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГодностиАдминистративный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Управляющий</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Коробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Сотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Заказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_УпаковочныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаявкаНаСклад</Name>
					<Comment>Старая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерБобины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_КодПродукта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_ИнформацияОПродукте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_УпотребитьДо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_Roll_ID</Name>
					<Comment>Штрих-код EPSMA Roll ID короткий. (Правай часть от Roll Number)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_Товароместо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_РабочегоЦентра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ПриходРасходТовароместа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ТовароместоUID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаказаСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Конверта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_СотрудникаПолныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ВходящихДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Растарки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_КартаСнятияПерерасхода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ТипоразмерПаллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета2_0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_УстановкаСрокаГодностиМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПропуститьВопросПередЗаписью; // Для отработки записи после вопроса

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	

	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаявкаНаРемонтРЦ") Тогда 
		Объект.ЗаявкаНаРемонтРЦ=Параметры.ЗаявкаНаРемонтРЦ;
	КонецЕсли;
	
	Если Параметры.Свойство("РабочийЦентр") Тогда 
		Объект.РабочийЦентр=Параметры.РабочийЦентр;
	КонецЕсли;
	

	
	УстановитьУсловноеОформление(); 
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ПриЧтенииСозданииНаСервере();
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	СразуНаПринтер=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);	
Утверждение();
	
КонецПроцедуры



&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//УсловноеОформление.Элементы.Очистить();
	
	
	//НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма); 
	//НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");
	//НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);
	//
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.Лико_ПередачаТоваров);
	
	
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, ПараметрыЗаполненияРеквизитов);
	
	
	ПересчитатьВесОбъемВСтрокахТЧ();
	//Элементы.ГруппаИнформация.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект,Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() 	
		
КонецПроцедуры 



&НаСервере
Процедура ПересчитатьВесОбъемВСтрокахТЧ()
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", "");
	
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Перем ТекущаяСтрока;
	Перем СтруктураДействий;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействий.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	Суффикс = "";
	
	СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу"      , ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	//+m.shenderov 10.07.2017 
	
	Характеристика	=Элементы.Товары.ТекущиеДанные.Характеристика;
	Нарезка			=ПолучитьНарезку(Характеристика);
	Серия			=Элементы.Товары.ТекущиеДанные.Серия;
	Если ЗначениеЗаполнено(Нарезка) Тогда
		Элементы.Товары.ТекущиеДанные.Упаковка=ПолучитьУпаковку(Нарезка);
		КоличествоУпаковокПриИзменении(Элемент);
		
		Если ЗначениеЗаполнено(Серия)и Нарезка<>Серия.ЯССМ_ОбъектНоменклатуры.Нарезка Тогда
			ОбъектНоменклатуры=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
			ОбъектНоменклатуры.Нарезка=Нарезка;
			ОбъектНоменклатуры.ЕдиницаИзмеренияУУ=Элементы.Товары.ТекущиеДанные.Упаковка;
			ОбъектНоменклатуры.Записать();
			Серия.ПолучитьОбъект.Записать();			
		КонецЕсли;		
	КонецЕсли;	
	//-m.shenderov 10.07.2017	
	
КонецПроцедуры


//+m.shenderov 10.07.2017  
#Область Дополнительно
&НаСервереБезКонтекста
Функция ПолучитьНарезку (Характеристика)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика,"ЯССМ_Нарезка")	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУпаковку(Нарезка)
	Возврат	Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Нарезка)
	
КонецФункции

&НаСервереБезКонтекста 
Функция ЗначениеРеквизитаОбъектаСервер(Ссылка, ИмяРеквизита) 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,ИмяРеквизита);		
КонецФункции 

&НаКлиенте
Процедура ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры)
	Если Не ЗначениеЗаполнено(ОбъектНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	БыстраяПечать=Лико_Дополнительно.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	КоличествоЭкземпляров=0;
	
	ТабДокумент=Лико_Дополнительно.ПараметрыПечатиОбъектаНоменклатуры(ОбъектНоменклатуры,,БыстраяПечать);
	//!ТабДокумент.ИмяПринтера = ИмяПринтера;
	
	//
	//ТабДокумент.АвтоМасштаб = Истина;
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабДокумент.ПолеСлева = 1;
	//ТабДокумент.ПолеСправа = 0;
	//ТабДокумент.ПолеСнизу = 0;
	//ТабДокумент.ПолеСверху = 1;
	////
	//ТабДокумент.РазмерСтраницы="Custom";//нестандартный размер бумаги
	//ТабДокумент.ВысотаСтраницы=64;
	//ТабДокумент.ШиринаСтраницы=90; 		
	
	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ТабДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если БыстраяПечать Тогда
		ТабДокумент.Напечатать();
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;  	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Суффикс = "";
	
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	
	
	
	ОткрытьПодборСерий("Товары");
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьПодборСерий(ИмяТЧ, Текст = "", ТекущиеДанные = Неопределено)
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные) Тогда
		
		
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",ТекущиеДанные.Характеристика);
		Структура.Вставить("Склад",Объект.Склад);
		Структура.Вставить("ТолькоОстатки",Истина);
		
		
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ПодборСерийЗавершение(РезультатФорма,ПараметрыФорма) Экспорт 
	
	Если ТипЗнч(РезультатФорма)=Тип("Массив") Тогда
		
		Для каждого Серия Из РезультатФорма  Цикл
			
			СтруктураНоменклатуры=ПолучитьСтруктуруСерии(Серия);
			
			СтруктураОтбора=Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура",СтруктураНоменклатуры.Номенклатура);
			СтруктураОтбора.Вставить("Характеристика",СтруктураНоменклатуры.Характеристика);
			СтруктураОтбора.Вставить("Серия",ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
			
			СтрокиСПустымиСериями=Объект.Товары.НайтиСтроки(СтруктураОтбора);
			Для каждого СтрокаСПустйСерией Из СтрокиСПустымиСериями Цикл				
				Объект.Товары.Удалить(Объект.Товары.Индекс(СтрокаСПустйСерией));				
			КонецЦикла;
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 				 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,СтруктураНоменклатуры);
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");      
				Действия 			= Новый Структура();
				ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( Действия,"");	
				Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
				ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НовыйТовар,Действия,КэшированныеЗначения);			
				
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ЗаполнитьСлужебныеРеквизитыТЧТоварыСервер();
		
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыТЧТоварыСервер() //+Лико m.shenderov 25.10.2017
	
	//ЗаполнитьСлужебныеРеквизитыТЧТовары();
	
КонецПроцедуры  //-Лико m.shenderov 25.10.2017



&НаСервереБезКонтекста
Функция УчетПоСериям(Товар) //+Лико m.shenderov 25.10.2017
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВидыНоменклатуры.Ссылка = Номенклатура.ВидНоменклатуры
	|ГДЕ
	|	Номенклатура.Ссылка = &Товар
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыНоменклатуры.ИспользоватьСерии";
	Запрос.УстановитьПараметр("Товар",Товар );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ИспользоватьСерии;
	КонецЦикла; 
	
	Возврат Ложь;
	
	
КонецФункции  //-Лико m.shenderov 25.10.2017



&НаКлиенте
Процедура ОткрытьПодборСерийЗавершение(ИмяТЧ, Текст, ТекущиеДанные)
	// Вставить содержимое метода.
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий[ИмяТЧ],Текст, ТекущиеДанные)
		и Лико_ОбщегоНазначенияСервер.ЕстьОбъектНоменклатуры(ТекущиеДанные.Номенклатура,ТекущиеДанные.Характеристика) Тогда
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
		Структура.Вставить("Характеристика",ТекущиеДанные.Характеристика);
		Структура.Вставить("Склад",Объект.Склад);
		Структура.Вставить("ТолькоОстатки",Истина);
		
		
		ОписаниеОповещения= Новый ОписаниеОповещения("Лико_ОткрытьПодборСерийЗавершение",ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаПодбораСерии",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;	 
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура Лико_ОткрытьПодборСерийЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 28.09.2017
	
	Если РезультатФормы<>Неопределено Тогда
		Счет=0;
		Для каждого Результат Из РезультатФормы Цикл
			Счет=Счет+1;
			Если Счет=1 И  ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Серия) Тогда
				Счет=2;
			КонецЕсли;
			
			Если Счет>1 Тогда 	
				Отбор= Новый Структура;
				Отбор.Вставить("Серия",Результат.Серия);
				НайденныеСтроки=Объект.Товары.НайтиСтроки(Отбор); 
				Если  НайденныеСтроки.Количество()>0 Тогда
					Элементы.Товары.ТекущаяСтрока=Объект.Товары.Индекс(НайденныеСтроки[0]);
					Для каждого Стр Из НайденныеСтроки Цикл
						
					КонецЦикла;
				Иначе
					Элементы.Товары.СкопироватьСтроку();
				КонецЕсли;
				
			КонецЕсли; 			
			ТекСтрока				=Элементы.Товары.ТекущиеДанные;			
			ТекСтрока.Серия			=Результат.Серия;
			Данныесерии				=ПолучитьДанныеПоСерии(Результат.Серия);
			ТекСтрока.Упаковка		=ДанныеСерии.Упаковка;
			ТекСтрока.АдресХранения	=Результат.АдресХранения;
			ТекСтрока.КоличествоУпаковок=Результат.Количество; 	
			Действия 			= Новый Структура();
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( Действия,"");	
			Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекСтрока,Действия,КэшированныеЗначения);						
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 28.09.2017



&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор, ИмяТЧ)
	
	Возврат НоменклатураСервер.ПараметрыФормыУказанияСерий(Объект, ПараметрыУказанияСерий, ТекущиеДанныеИдентификатор, ЭтаФорма);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоСерии(Серия) //+Лико m.shenderov 28.09.2017
	
	//Серия=Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Структура = Новый Структура;
	Структура.Вставить("Количество",Серия.ЯССМ_ОбъектНоменклатуры.Количество);
	Структура.Вставить("Упаковка",Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);	
	Возврат Структура; 
	
	
КонецФункции  //-Лико m.shenderov 28.09.2017


&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СкладПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер () //+Лико m.shenderov 10.10.2017
	
	ПриЧтенииСозданииНаСервере();		
	ЗаполнитьСтатусыУказанияСерий();
КонецПроцедуры  //-Лико m.shenderov 10.10.2017

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерий() //+Лико m.shenderov 10.10.2017
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
	
КонецПроцедуры  //-Лико m.shenderov 10.10.2017





&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(ГлЛико_Оператор) и Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//ОчиститьСообщения(); 	
		//ТекстПредупреждения = НСтр("ru = 'Пользователь не авторизован, пожалуйста, отсканируйте ваш пропуск!'");		
		//ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		
		Структура = Новый Структура;
		Структура.Вставить("ИмяДокумента","Лико_УстановкаСрокаГодностиМатериалов");
		ОткрытьФорму("ОбщаяФорма.Лико_ФормаАвторизацииСклада",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		Отказ=Истина;
	КонецЕсли; 
	
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		//Если Не ЗначениеЗаполнено(ГлЛико_Оператор) Тогда
		//	Сообщить("Не выполнена авторизация!");
		//	Отказ=Истина;
		//КонецЕсли;
		Объект.АвторДокумента=ГлЛико_Оператор;
	КонецЕсли;
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьВидимость();
КонецПроцедуры



// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Объект.Отправитель=Неопределено;
	Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда
		ПометитьНаУдалениеРаспоряжение(Объект.Распоряжение);	
		Объект.Распоряжение=Неопределено;	
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	УстановитьУсловноеОформление();
	ПриЧтенииСозданииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
		
КонецПроцедуры


&НаКлиенте
Процедура ПечатьЗаявки() //+Лико m.shenderov 02.03.2018
	
	ВыполняемаяОбработка=НайтиПФ("Печатная форма документа ""Заявка на склад""");
	Если ВыполняемаяОбработка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ОбъектыНазначения=Новый Массив;
	ОбъектыНазначения.Добавить(Объект.Ссылка);
	//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
	ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
	ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
	ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="Лико_ЗаявкаНаСкладСИМ";
	ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 
	
КонецПроцедуры //-Лико m.shenderov 02.03.2018


&НаСервереБезКонтекста
Функция НайтиПФ(Наименование)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование); 
КонецФункции




Процедура ПометитьНаУдалениеРаспоряжение(Ссылка) //+Лико m.shenderov 16.10.2017
	
	ОбъектСсылка=Ссылка.получитьОбъект();
	ОбъектСсылка.ПометкаУдаления=Истина;
	ОбъектСсылка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры //-Лико m.shenderov 16.10.2017

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Паллета") Тогда
			//Это паллет
		ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
			Объект.Сотрудник = Результат.Сотрудник;
			
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ЗаказаСпецификации") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа);
			Объект.НомерБланка=Результат.НомерБланка;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Заказа") Тогда
			Объект.ЗаказКлиента=ПолучитьЗаказКлиентаПоНомеру(Результат.НомерЗаказа); 			
			
			
			
		ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
			ИЛИ Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
			//Это ячейка
			//Элементы.Товары.ТекущиеДанные. = Результат.АдресаХранения;
			//
			//Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
		Иначе
			ОбработатьШтрихкодыТиповой(ДанныеШтрихкода);
			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкодыТиповой(ДанныеШтрихкодов)
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул")); 	
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПересчитатьВесОбъем");
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок( СтруктураДействийСДобавленнымиСтроками,"");
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	СтруктураДействийСИзмененнымиСтроками.Вставить("ЗаполнитьПризнакТовМестаТребуетсяОбработка");
	СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьВесОбъем");
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействийСИзмененнымиСтроками,"");
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = Новый Структура;
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
	Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ПересчитатьВесОбъем");
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
	
	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	СтруктураДействий.ПараметрыУказанияСерий                 = ПараметрыУказанияСерий;
	СтруктураДействий.ТолькоТовары                           = Истина;
	
	
	СтруктураДействий.ДействияСНеизвестнымиШтрихкодами       = "НетДействий";
	СтруктураДействий.СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = СтруктураДействийСоСтрокамиИзУпаковочныхЛистов;
	
	
	
	ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
		
	КонецЕсли;
	
	Элементы.Товары.ТекущиеДанные.АдресХранения=Лико_ОбщегоНазначенияСервер.ПолучитьАдресХраненияПоСерии(Элементы.Товары.ТекущиеДанные.Серия,Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,СтруктураДействий,КэшированныеЗначения);
	
	СтруктураДействийСТекущейСтрокой = Новый Структура;
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	//СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьВесУпаковки",Новый Структура("Номенклатура, Упаковка", "ВесУпаковки"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьОбъемУпаковки",Новый Структура("Номенклатура, Упаковка", "ОбъемУпаковки"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияВеса",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияВеса"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьЕдиницуИзмеренияОбъема",Новый Структура("Номенклатура, Упаковка", "ЕдиницаИзмеренияОбъема"));
	СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьВесОбъем");
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока);
	
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействийСТекущейСтрокой, КэшированныеЗначения);
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	//+m.shenderov 11.07.2017
	ПечатьЭтикеток=Ложь ;	
	ОчиститьСообщения();  	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрано ни одного товара.'");
		
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	Для каждого Стр Из ВыделенныеСтроки Цикл
		Товар= Объект.Товары.НайтиПоИдентификатору(Стр);
		ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Серия,"ЯССМ_ОбъектНоменклатуры");
		
		Если ОбъектНоменклатуры=Неопределено Тогда
			ОбъектНоменклатуры=Лико_ОбщегоНазначенияСервер.ПолучитьОбъектНоменклатуры(Товар.Номенклатура);
		КонецЕсли;
		
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры); 
		ПечатьЭтикеток=Истина;
	КонецЦикла;	
	Если ПечатьЭтикеток Тогда
		Возврат;
	КонецЕсли;
	//-m.shenderov 11.07.2017
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю1(Команда)
	Объект.ЧленКомиссии1=ГлЛико_Оператор;
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю2(Команда)
	Объект.ЧленКомиссии2=ГлЛико_Оператор;
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвержаю3(Команда)
	Объект.ЧленКомиссии3=ГлЛико_Оператор;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПодборФорм(Команда)
	Структура = Новый Структура;
	Структура.Вставить("РабочийЦентр",Объект.Отправитель);
	ОписаниеОповещения= Новый ОписаниеОповещения("ПодборФормЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Лико_Формы.Форма.ФормаПодбора",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ПодборФормЗавершение(РезультатФормы,ПараметрыФормы) Экспорт  
	Если ТипЗнч(РезультатФормы)=Тип("Структура") Тогда
		Для каждого Форма Из РезультатФормы.Массив Цикл
			Если Объект.Формы.НайтиСтроки(Новый Структура("Форма",Форма)).количество()=0 Тогда
				НоваяФорма=Объект.Формы.Добавить();
				НоваяФорма.Форма=Форма;
				НоваяФорма.Конверт=РезультатФормы.Соответствие[Форма];
			КонецЕсли;
			
			
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ДанныеПоНаработке(Команда)
	Объект.ДанныеПоНаработке = Не Объект.ДанныеПоНаработке;
	
	УстановитьВидимость();
	
КонецПроцедуры



&НаКлиенте
Процедура ПечатьСтикераДокумента1(Команда)
	ПечатьСтикераДокумента();
КонецПроцедуры


&НаКлиенте
Процедура ПечатьСтикераДокумента(БыстраяПечать=Истина)  	
	ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСтикераДокумента(Объект.Ссылка);	
	
	Если ПечатьСразуНаПринтер() Тогда
		ТабДокумент.Напечатать(БыстраяПечать);
	Иначе
		ТабДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция ПечатьСразуНаПринтер() //+Лико m.shenderov 19.10.2017
	Возврат	Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
КонецФункции  //-Лико m.shenderov 19.10.2017


&НаКлиенте
Процедура ПечатьСкладскойКарточки(Команда)
	
	Если Не Объект.Проведен Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Распечатать карточку складской операции можно только после проведения документа!", СтатусСообщения.Важное, Ложь);
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("ДатаВремя", Объект.Дата);
	Данные.Вставить("Номер", Объект.Номер);
	Данные.Вставить("ВидОперации", Объект.ВидОперации);
	Данные.Вставить("НомерЗаказа", Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента,"Номер"),7));
	Данные.Вставить("Сотрудник", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(Объект.Сотрудник)));
	Данные.Вставить("Получатель", Объект.АдресХранения);
	Данные.Вставить("АвторДокумента", ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(Строка(Объект.АвторДокумента)));
	
	//Если Товары.Количество()>3 Тогда
	//	Если Вопрос("Будет распечатано "+Товары.Количество()+" карточек складских операций. Вы уверены, что хотите распечатать все эти карточки?", РежимДиалогаВопрос.ДаНет, 5, КодВозвратаДиалога.Нет, "Внимание!")=КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	КоличествоКопий = 1;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		
		Данные.Вставить("КоличествоЕдиницаИзмерения", "" + СтрокаТовары.Количество + " " + СтрокаТовары.Упаковка);
		Данные.Вставить("ОбъектНоменклатуры", СтрокаТовары.Серия);
		Данные.Вставить("Дополнительное", "");
		
		// переопределим адрес хранения для ролика
		Данные.Вставить("Получатель", СтрокаТовары.АдресХранения);
		
		
		ТабДокумент=Лико_ОбщегоНазначенияСервер.ПечатьСкладскойОперации(Данные, КоличествоКопий, СразуНаПринтер());
		
		Если КоличествоКопий > 0 Тогда
			ТабДокумент.КоличествоЭкземпляров = КоличествоКопий;
		КонецЕсли;
		
		Если СразуНаПринтер() Тогда
			ТабДокумент.Напечатать(СразуНаПринтер());
		Иначе
			ТабДокумент.Показать();
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если Объект.Формы.Количество()>0 Тогда
		
		ВремФормы = Объект.Формы.Выгрузить();
		ТабДокумент=Лико_ОбщегоНазначенияСервер.ФормыПечатьСкладскойОперации(ВремФормы, Данные, Ложь, КоличествоКопий, СразуНаПринтер());
		
		Если КоличествоКопий > 0 Тогда
			ТабДокумент.КоличествоЭкземпляров = КоличествоКопий;
		КонецЕсли;
		
		Если СразуНаПринтер() Тогда
			ТабДокумент.Напечатать(СразуНаПринтер());
		Иначе
			ТабДокумент.Показать();
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СразуНапринтер() //+Лико m.shenderov 22.10.2017
	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьСразуНаПринтер",Ложь);
	
КонецФункции  //-Лико m.shenderov 22.10.2017


&НаКлиенте
Процедура ЗаказКлиенткаПриИзменении(Элемент)
	Попытка
		Объект.НомерЗаказа=Число(Прав(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.ЗаказКлиента,"Номер"),7));
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеЗаказаКлиента(Форма,Объект,
	ИмяПоляВводаЗаказаКлиента = "ЗаказКлиента",
	ПутьКПолюОтбора = "Объект.ЗаказКлиента") Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаЗаказаКлиента].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Проведен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	НЗаказа=Прав(Объект.ЗаказКлиента.Номер,7);
	
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст","111" );
	//ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Склад",Объект.Склад);	
	Структура.Вставить("Период",?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	Структура.Вставить("ТолькоОстатки",Истина);
	
	Если Не Структура.Свойство("Помещение") Тогда
		ПомещениеПроизводство=ПолучитьПомещениеПроизводство();
		Структура.Вставить("Помещение",ПомещениеПроизводство);
	КонецЕсли;
	
	
	ОписаниеОповещения=Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбора_Склад",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПомещениеПроизводство()	
	Возврат Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПомещениеСИМ",Неопределено);
КонецФункции  


&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 25.10.2017
	Если ТипЗнч(РезультатФормы)=Тип("Массив") Тогда
		
		Для каждого Товар Из РезультатФормы  Цикл
			ТекущаяСтрока = Товар;
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
			
			// Если  ЗначениеЗаполнено(Товар.Серия) Тогда
			//    
			// СтруктураСерии= ПолучитьСтруктуруСерии(Товар.Серия);
			// 
			// 
			//КонецЕсли;
			
			
			СтруктураНоменклатуры = Новый Структура;
			СтруктураНоменклатуры.Вставить("Номенклатура");
			СтруктураНоменклатуры.Вставить("Характеристика");
			СтруктураНоменклатуры.Вставить("Серия");
			
			ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Товар);
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 			 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);
				
				НовыйТовар.АдресХранения=Товар.Ячейка;
				
				
				НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры");  
				
		     	НовыйТовар.Количество=НовыйТовар.КоличествоУпаковок*Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Упаковка,"Числитель");
				
				
				
				
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		
		
		ПослеЗаписиНаСервере();
		
		
		
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 25.10.2017


&НаСервереБезКонтекста
Функция ПолучитьСтруктуруСерии(Серия) //+Лико m.shenderov 24.10.2017
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",Неопределено);
	Структура.Вставить("Характеристика",Неопределено);
	Структура.Вставить("КоличествоУпаковок",Неопределено);
	Структура.Вставить("Серия",Неопределено);
	Структура.Вставить("Упаковка",Неопределено);
	Структура.Вставить("Количество",Неопределено); 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|	СерииНоменклатуры.Ссылка КАК Серия,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Характеристика КАК Характеристика,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения КАК Упаковка,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Количество КАК КоличествоУпаковок,
	|	СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.Количество * СерииНоменклатуры.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель КАК Количество
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Ссылка = &Серия";
	Запрос.УстановитьПараметр("Серия",Серия );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
	КонецЦикла; 
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 24.10.2017



&НаСервереБезКонтекста
Функция ПолучитьЗаказКлиентаПоНомеру(НомерЗаказа) //+Лико m.shenderov 30.11.2017
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.НомерБезПрефикса = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа",НомерЗаказа );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла; 
	Возврат Неопределено;
	
	
КонецФункции  //-Лико m.shenderov 30.11.2017


&НаСервереБезКонтекста
Функция СотрудникАвтоПодборНаСервере(Текст)
	
	СписокЗначений= Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Код ПОДОБНО &Код
	|	И Сотрудники.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Код","%"+Текст+"%" );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Ссылка);
		
	КонецЦикла; 
	Возврат СписокЗначений;	
КонецФункции


&НаКлиенте
Процедура СотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Попытка
		Код=Число(Текст);
		СтандартнаяОбработка=Ложь;
		ДанныеВыбора=СотрудникАвтоПодборНаСервере(Текст);
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьЗаявкуЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Отменить заявку?",РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры	 
//Вынести в отдельную процедуру
&НаКлиенте
Процедура ОтменитьЗаявкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ПометкаУдаления=Истина;
		ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));		
	КонецЕсли;
	


КонецПроцедуры


&НаСервере
Процедура Утверждение()
	
	Если ЗначениеЗаполнено(Объект.ДатаУтверждения) Тогда 
		//Проверяем, есть ли кнопка утверждения и убираем ее
		Элем = Элементы.Найти("Утвердить");
		Если Элем <> Неопределено Тогда 
			Элементы.Удалить(Элем);
		КонецЕсли;	
	
		ОтменитьУтверждение=Элементы.Добавить("ОтменитьУтверждение", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
    	ОтменитьУтверждение.Заголовок="Утвердил: "+  Объект.Утвердил.Наименование+ " "+Строка(Объект.ДатаУтверждения);
    	ОтменитьУтверждение.ИмяКоманды="ОтменитьУтверждение";
		ОтменитьУтверждение.Отображение = ОтображениеКнопки.КартинкаИТекст;
		ОтменитьУтверждение.Картинка = БиблиотекаКартинок.ОтметитьОперациюВыполненной;
				
		
				
	Иначе
		Элем = Элементы.Найти("ОтменитьУтверждение");
		Если Элем <> Неопределено Тогда 
			Элементы.Удалить(Элем);
		КонецЕсли;	
		Утвердить=Элементы.Добавить("Утвердить", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
    	Утвердить.Заголовок="Утвердить";
    	Утвердить.ИмяКоманды="Утвердить";
		Утвердить.Картинка = БиблиотекаКартинок.Успешно;
		КонецЕсли;	
		
		
	

КонецПроцедуры




&НаКлиенте
Процедура Утвердить1(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Если ЭтаФорма.Модифицированность Тогда
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("БылВопросПередЗаписью", Истина);
			Записать(ПараметрыЗаписи);
		КонецЕсли;
	Иначе
		Сообщить("Необходимо записать документ!");
		Возврат;
	КонецЕсли;	
	//Если Не ПроверитьДоступностьНаСервере("Лико_ЗакрытиеОтгрузки") Тогда
		//КонецЕсли;
		Объект.ДатаУтверждения =  ТекущаяДата();
		Объект.Утвердил =  ПользователиКлиентСервер.ТекущийПользователь(); 
		Утверждение();

		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("БылВопросПередЗаписью", Истина);
		Записать(ПараметрыЗаписи);

	КонецПроцедуры
	
	
	


&НаКлиенте
Процедура ОтменитьУтверждение(Команда)
		Объект.Утвердил = ПользователиКлиентСервер.ТекущийПользователь(); 
		Объект.ДатаУтверждения = Дата(1,1,1);
		Утверждение();
		
КонецПроцедуры


&НаКлиенте
Процедура ПродлитьСрокКодности(Команда)
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ВводЧислаЗавершение",ЭтаФорма)
	,0," Кол. дн.",5,0);
КонецПроцедуры

&НаКлиенте
Процедура ВводЧислаЗавершение(пРезультат,пПараметры) Экспорт
	
	Если ЗначениеЗаполнено(пРезультат) Тогда
		Для каждого Товар Из Объект.Товары Цикл
			ОбъектНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Серия,"Яссм_ОбъектНоменклатуры");
			УпотребитьДо=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ОбъектНоменклатуры,"УпотребитьДо");
			УпотребитьДо=?(ЗначениеЗаполнено(УпотребитьДо),УпотребитьДо,ТекущаяДата());
			Товар.УпотребитьДоНовый=УпотребитьДо+ (пРезультат*60*60*24); 		 	
		 КонецЦикла;
		
	КонецЕсли;
	
		
КонецПроцедуры


&НаКлиенте
Процедура ПрисоединенныеФайлы(Команда)

	СтруктураПараметрыВыбора =
		Новый Структура("ВладелецФайла, ЗакрыватьПриВыборе, РежимВыбора", Объект.Ссылка, Ложь, Ложь);

	ОткрытьФорму(
		"Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
		СтруктураПараметрыВыбора,,,,,
		//Новый ОписаниеОповещения("ВыбратьКартинкуИзПрисоединенныхФайловЗавершение", ЭтотОбъект)
		,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		Лико_СкладыКлиент.ПоказатьФормуОбъектаНоменклатуры(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка,"ТоварыНомерПоставки");

КонецПроцедуры

&НаСервере
Процедура ВводДатыЗавершение(пРезультат,пПараметры) Экспорт
		
	Если ЗначениеЗаполнено(пРезультат) Тогда
			 		
		МассивНоменклатур = Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		СрокГодностиНоменклатуры = РегистрыСведений.Лико_СрокиГодностиНоменклатуры.СрокГодностиНоменклатуры(Объект.Склад.Лико_Площадка,МассивНоменклатур,Объект.Дата);
		
		Для каждого Товар Из Объект.Товары Цикл
			
			Товар.УпотребитьДоНовый=пРезультат; 
			
			СрокГодности = СрокГодностиНоменклатуры[Товар.Номенклатура];				
			Если ЗначениеЗаполнено(СрокГодности) Тогда
				Товар.ДатаПроизводстваНовый = Товар.УпотребитьДоНовый-СрокГодности*60*60*24;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	

КонецПроцедуры

&НаСервере
Процедура ВводДатыПроизводстваЗавершение(пРезультат,пПараметры) Экспорт
		
	Если ЗначениеЗаполнено(пРезультат) Тогда
		
		МассивНоменклатур = Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		СрокГодностиНоменклатуры = РегистрыСведений.Лико_СрокиГодностиНоменклатуры.СрокГодностиНоменклатуры(Объект.Склад.Лико_Площадка,МассивНоменклатур,Объект.Дата);
		
		Для каждого Товар Из Объект.Товары Цикл
			
			
			Товар.ДатаПроизводстваНовый=пРезультат;
			СрокГодности = СрокГодностиНоменклатуры[Товар.Номенклатура];				
			Если ЗначениеЗаполнено(СрокГодности) Тогда
				Товар.УпотребитьДоНовый = Товар.ДатаПроизводстваНовый+СрокГодности*60*60*24;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
Процедура ПродлитьСрокГодностиДоДаты(Команда)
	ПоказатьВводДаты(Новый ОписаниеОповещения("ВводДатыЗавершение",ЭтаФорма)
	,0,"Дата");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатауПроизводства(Команда)
	ПоказатьВводДаты(Новый ОписаниеОповещения("ВводДатыПроизводстваЗавершение",ЭтаФорма)
	,0,"Дата");

КонецПроцедуры


//&НаКлиенте
//Процедура УстановитьДатауПроизводства(Команда)
//	ПоказатьВводДаты(Новый ОписаниеОповещения("ВводДатыУпотребитьДоЗавершение",ЭтаФорма)
//	,0,"Дата");

//КонецПроцедуры


&НаКлиенте
Асинх Процедура ПодборПоПартии(Команда)
	НомерПартии="";	
	НомерПартии=Ждать ВвестиСтрокуАсинх(НомерПартии,"Введите номер партии!" );
	Если Не ЗначениеЗаполнено(НомерПартии) Тогда
		Возврат;
	КонецЕсли;
	
	
	Массив=ПолучитьОстаткиПоПартииСервер(Объект.Организация,НомерПартии);
	Для каждого СтрМассива Из  Массив Цикл
		НайденныеСтроки=Объект.Товары.НайтиСтроки( Новый Структура("Серия",СтрМассива.Серия));
		Если НайденныеСтроки.Количество()=0 Тогда
			НоваяСтрокаТовары=Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,СтрМассива);		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьОстаткиПоПартииСервер (Организация,НомерПартии) //+Лико m.shenderov 02.08.2021
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
|	ТоварыВЯчейкахОстатки.ВНаличииОстаток * ТоварыВЯчейкахОстатки.Упаковка.Числитель КАК Количество,
|	ТоварыВЯчейкахОстатки.Ячейка КАК АдресХранения,
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
|	ТоварыВЯчейкахОстатки.Серия КАК Серия
|ИЗ
|	РегистрНакопления.ТоварыВЯчейках.Остатки(
|			,
|			Ячейка.Помещение.Лико_Организация = &Организация
|				И Серия.ЯССМ_ОбъектНоменклатуры.НомерПартииИзготовления = &НомерПартии) КАК ТоварыВЯчейкахОстатки";
Запрос.УстановитьПараметр("НомерПартии",НомерПартии );
Запрос.УстановитьПараметр("Организация",Организация );

Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());




		
КонецФункции //-Лико m.shenderov 02.08.2021

&НаСервере
Процедура ТоварыУпотребитьДоНовыйПриИзмененииНаСервере(ТД)
				 		
		МассивНоменклатур =Новый Массив(); 
		МассивНоменклатур.Добавить(ТД.Номенклатура);
		
		СрокГодностиНоменклатуры = РегистрыСведений.Лико_СрокиГодностиНоменклатуры.СрокГодностиНоменклатуры(Объект.Склад.Лико_Площадка,МассивНоменклатур,Объект.Дата);
		
					
		
			
			СрокГодности = СрокГодностиНоменклатуры[ТД.Номенклатура];				
			Если ЗначениеЗаполнено(СрокГодности) Тогда
				ТД.ДатаПроизводстваНовый = ТД.УпотребитьДоНовый-СрокГодности*60*60*24;
			КонецЕсли;
			
				

КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпотребитьДоНовыйПриИзменении(Элемент)
		ТД = Элементы.Товары.ТекущиеДанные;
	
	
	СрокГодности =ТоварыДатаПроизводстваНовыйПриИзмененииНаСервере(ТД.Номенклатура);
	Если ЗначениеЗаполнено(СрокГодности) Тогда
		ТД.ДатаПроизводстваНовый = ТД.УпотребитьДоНовый-СрокГодности;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТоварыДатаПроизводстваНовыйПриИзмененииНаСервере(Номенклатура)
		МассивНоменклатур =Новый Массив(); 
		МассивНоменклатур.Добавить(Номенклатура);
		
		СрокГодностиНоменклатуры = РегистрыСведений.Лико_СрокиГодностиНоменклатуры.СрокГодностиНоменклатуры(Объект.Склад.Лико_Площадка,МассивНоменклатур,Объект.Дата);
		
					
		
			
			СрокГодности = СрокГодностиНоменклатуры[Номенклатура];				
			Если ЗначениеЗаполнено(СрокГодности) Тогда
			
				Возврат СрокГодности*60*60*24;
				
			КонецЕсли;
		Возврат 0;	
КонецФункции

&НаКлиенте
Процедура ТоварыДатаПроизводстваНовыйПриИзменении(Элемент)
	
	
	ТД = Элементы.Товары.ТекущиеДанные;
	
	
	СрокГодности =ТоварыДатаПроизводстваНовыйПриИзмененииНаСервере(ТД.Номенклатура);
	Если ЗначениеЗаполнено(СрокГодности) Тогда
		ТД.УпотребитьДоНовый = ТД.ДатаПроизводстваНовый+СрокГодности;
		
	КонецЕсли;

КонецПроцедуры
